Revit 2027 API
IExternalResourceServer.SetupBrowserData Method
 Implement this method to setup external resource browser data which will be accessed in Revit external resource browser UI.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void SetupBrowserData(
	ExternalResourceBrowserData browseData
)
Sub SetupBrowserData (
	browseData As ExternalResourceBrowserData
)
void SetupBrowserData(
	ExternalResourceBrowserData^ browseData
)
abstract SetupBrowserData :
        browseData : ExternalResourceBrowserData -> unit
Parameters
browseData ExternalResourceBrowserData
 The input context to match the external resources and browser results returned by the server.
Remarks
 If errors occur during setup, store this information externally, and then retrieve and deal with the errors during the call to HandleBrowseResult() of your IExternalResourceUIServer.
See Also
Reference
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace